modm-ext/data.modm.io/docs/svd/header_stm32wl54xx.svd
        <register>
          <name>C2CR3</name>
          <description>PWR Power Control Register 3 for CPU2</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EWUP1</name>
              <description>Enable external WKUP Pin 1 [line 0] for CPU2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP2</name>
              <description>Enable external WKUP Pin 2 [line 1] for CPU2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP3</name>
              <description>Enable external WKUP Pin 3 [line 2] for CPU2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWPVD</name>
              <description>Enable wakeup PVD for CPU2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APC</name>
              <description>Apply pull-up and pull-down configuration for CPU2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWRFBUSY</name>
              <description>Enable Radio busy IRQ and wake-up for CPU2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Radio busy trigger action: no wake-up from low-power mode and no interruption sent to the selected CPU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WU_IT</name>
                  <description>Radio busy trigger action: wake-up from low-power mode Standby and interruption sent to the selected CPU.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EWRFIRQ</name>
              <description>Enable Radio IRQ[2:0] and wake-up for CPU2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Radio IRQ trigger action: no wake-up from low-power mode and no interruption sent to the selected CPU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WU_IT</name>
                  <description>Radio IRQ trigger action: wake-up from low-power mode Standby and interruption sent to the selected CPU.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIWUL</name>
              <description>Internal Wake-Up line interrupt for CPU2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTSCR</name>
          <description>PWR Power Status Reset Register for CPU2</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C1CSSF</name>
              <description>Clear standby and stop flags for CPU1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2CSSF</name>
              <description>Clear standby and stop flags for CPU2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1SBF</name>
              <description>System standby flag for CPU1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1STOP2F</name>
              <description>System stop2 flag for CPU1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1STOPF</name>
              <description>System stop0 or stop1 flag for CPU1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2SBF</name>
              <description>System standby flag for CPU2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2STOP2F</name>
              <description>System stop2 flag for CPU2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2STOPF</name>
              <description>System stop0 or stop1 flag for CPU2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1DS</name>
              <description>CPU1 deepsleep mode flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2DS</name>
              <description>CPU2 deepsleep mode flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGR</name>
          <description>PWR Security Configuration Register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C2EWILA</name>
              <description>CPU2 illegal access interrupt enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBGHZSPICR</name>
          <description>PWR SUBGHZSPI Control Register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NSS</name>
              <description>Sub-GHz radio SUBGHZSPI_NSS control</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSCMDR</name>
          <description>PWR RSS Command Register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RSSCMD</name>
              <description>RSS command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
